In [2]:
import pandas as pd
# %xmode minimal

In [3]:
t = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv')

## 6.1 Einfache Gruppierungen

a)

In [4]:
t.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [5]:
t["Cabin"].isna().sum()

687

In [6]:
t["Cabin"].isnull().sum()

687

In [7]:
t["Cabin"].shape

(891,)

b) <br>
Funktionen: <br>
Gruppieren einer Spalte: `groupby('Spalte)`<br>
Funktionen anwenden auf df/series: `apply(funktion, axis=0[vertikal auf Spalte]` oder
` axis=1[horizontal auf Zeile])` <br>
Summieren: `sum()`

In [8]:
na_count_pro_pclass = t.groupby('Pclass')['Cabin'].apply(lambda x: x.isna().sum())

print(na_count_pro_pclass)

Pclass
1     40
2    168
3    479
Name: Cabin, dtype: int64

c) <br>
Einzigartige Werte herausnehmen: `unique()` <br>
Liste sortieren: `sort()`

In [9]:
cabinen = list(t["Cabin"].unique())
cabinen = [str(c) for c in cabinen]
cabinen.sort()
print(cabinen)

['A10', 'A14', 'A16', 'A19', 'A20', 'A23', 'A24', 'A26', 'A31', 'A32', 'A34', 'A36', 'A5', 'A6', 'A7', 'B101', 'B102', 'B18', 'B19', 'B20', 'B22', 'B28', 'B3', 'B30', 'B35', 'B37', 'B38', 'B39', 'B4', 'B41', 'B42', 'B49', 'B5', 'B50', 'B51 B53 B55', 'B57 B59 B63 B66', 'B58 B60', 'B69', 'B71', 'B73', 'B77', 'B78', 'B79', 'B80', 'B82 B84', 'B86', 'B94', 'B96 B98', 'C101', 'C103', 'C104', 'C106', 'C110', 'C111', 'C118', 'C123', 'C124', 'C125', 'C126', 'C128', 'C148', 'C2', 'C22 C26', 'C23 C25 C27', 'C30', 'C32', 'C45', 'C46', 'C47', 'C49', 'C50', 'C52', 'C54', 'C62 C64', 'C65', 'C68', 'C7', 'C70', 'C78', 'C82', 'C83', 'C85', 'C86', 'C87', 'C90', 'C91', 'C92', 'C93', 'C95', 'C99', 'D', 'D10 D12', 'D11', 'D15', 'D17', 'D19', 'D20', 'D21', 'D26', 'D28', 'D30', 'D33', 'D35', 'D36', 'D37', 'D45', 'D46', 'D47', 'D48', 'D49', 'D50', 'D56', 'D6', 'D7', 'D9', 'E10', 'E101', 'E12', 'E121', 'E17', 'E24', 'E25', 'E31', 'E33', 'E34', 'E36', 'E38', 'E40', 'E44', 'E46', 'E49', 'E50', 'E58', 'E63', 'E67', 'E68', 'E77', 'E8', 'F E69', 'F G63', 'F G73', 'F2', 'F33', 'F38', 'F4', 'G6', 'T', 'nan']

d) <br>
LÃ¤nge einer Liste: `len(`Liste`)`

In [10]:
len(cabinen)

148

e)

In [11]:
t.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [12]:
t.groupby('Pclass')['Cabin'].unique()

Pclass
1    [C85, C123, E46, C103, A6, C23 C25 C27, nan, B...
2                [nan, D56, F33, E101, F2, F4, D, E77]
3       [nan, G6, F G73, F E69, E10, F G63, E121, F38]
Name: Cabin, dtype: object

In [13]:
t.loc[(t['Pclass']==1), 'Cabin'].unique()

array(['C85', 'C123', 'E46', 'C103', 'A6', 'C23 C25 C27', nan, 'B78',
       'D33', 'B30', 'C52', 'B28', 'C83', 'E31', 'A5', 'D10 D12', 'D26',
       'C110', 'B58 B60', 'D47', 'B86', 'C2', 'E33', 'B19', 'A7', 'C49',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'C22 C26', 'C106', 'C65', 'E36', 'C54', 'B57 B59 B63 B66',
       'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40', 'T', 'C128',
       'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E44', 'A34', 'C104',
       'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14', 'B37', 'C30',
       'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38', 'B39', 'B22',
       'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68', 'B41', 'A20',
       'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48', 'E58', 'C126',
       'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'C62 C64', 'E24', 'C90',
       'C45', 'E8', 'B101', 'D45', 'C46', 'D30', 'D11', 'B3', 'D6',
       'B82 B84', 'D17', 'A36', 'B102', 'B69', 'E49', 'C47', 'D28', 'E17',
       'A24', 'C50', 'B42', 'C148'], dtype=object)

In [14]:
t.loc[(t['Pclass']==2), 'Cabin'].unique()

array([nan, 'D56', 'F33', 'E101', 'F2', 'F4', 'D', 'E77'], dtype=object)

In [15]:

t.loc[(t['Pclass']==3), 'Cabin'].unique()

array([nan, 'G6', 'F G73', 'F E69', 'E10', 'F G63', 'E121', 'F38'],
      dtype=object)

f) <br>
Anzahl zÃ¤hlen: `count()` <br>
Maximum finden: `max()` <br>
Durchschnitt berechnen: `mean()`

In [16]:
t_grouped_cabin = t.groupby('Cabin')

In [17]:
t_grouped_cabin['PassengerId'].count().max()

4

In [18]:
t_grouped_cabin['PassengerId'].count().mean()

1.3877551020408163

g)

In [19]:
t.loc[t['Age']<18, 'Age'].isna().count()

113

In [20]:
t.loc[t['Age']<18, 'Age'].count()

113

In [21]:
print(t.loc[t['Age']<18][['Age', 'PassengerId']])

      Age  PassengerId
7     2.0            8
9    14.0           10
10    4.0           11
14   14.0           15
16    2.0           17
..    ...          ...
850   4.0          851
852   9.0          853
853  16.0          854
869   4.0          870
875  15.0          876

[113 rows x 2 columns]

## 6.2 Minimum

a) <br>
Kleinsten Wert finden: `min()`

In [22]:
t_class_group = t.groupby("Pclass")

In [23]:
t_class_group["Fare"].max()

Pclass
1    512.3292
2     73.5000
3     69.5500
Name: Fare, dtype: float64

In [24]:
t_class_group["Fare"].min()

Pclass
1    0.0
2    0.0
3    0.0
Name: Fare, dtype: float64

b) <br>
Index von erstem Max Wert: `idxmax()` <br>
Index von erstem Min Wert: `idxmin()` <br>
Liste erstellen: `list(`z.B. loc Ausgabe `)`

In [25]:
namen = list(t.loc[list(t_class_group["Fare"].idxmin()), 'Name'])

i=0
for name in namen:
    i += 1
    print(f'Klasse: {i} Name: {name}')

Klasse: 1 Name: Harrison, Mr. William
Klasse: 2 Name: Parkes, Mr. Francis "Frank"
Klasse: 3 Name: Leonard, Mr. Lionel

In [26]:
t.loc[list(t_class_group["Fare"].idxmax()), "Name"]

258              Ward, Miss. Anna
72           Hood, Mr. Ambrose Jr
159    Sage, Master. Thomas Henry
Name: Name, dtype: object

d) <br>
Finden der max/ min Werte : `nlargest()` <br>
<br>
`1`: Dies gibt an, dass du nur den grÃ¶Ãten Wert (oder die grÃ¶Ãten Werte) aus jeder Gruppe haben mÃ¶chtest. <br> <br>
`keep='all'`: Dies ist wichtig, wenn es mehrere gleich groÃe "grÃ¶Ãte Werte" in der Gruppe gibt. Normalerweise gibt nlargest nur den ersten dieser Werte zurÃ¼ck, wenn sie gleich groÃ sind. Aber mit keep='all' sorgst du dafÃ¼r, dass alle diese gleich groÃen maximalen Werte beibehalten werden.

In [27]:
idx = t.groupby(by="Pclass")["Fare"].nlargest(1, keep='all')
idx

Pclass
1       258    512.3292
        679    512.3292
        737    512.3292
2       72      73.5000
        120     73.5000
        385     73.5000
        655     73.5000
        665     73.5000
3       159     69.5500
        180     69.5500
        201     69.5500
        324     69.5500
        792     69.5500
        846     69.5500
        863     69.5500
Name: Fare, dtype: float64

In [29]:
idxx = t.groupby(by="Pclass")

In [30]:
for Pclass, group in idxx:
    print(f'Pclass {Pclass}   group: {group}')

Pclass 1   group:      PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
6              7         0       1
11            12         1       1
23            24         1       1
..           ...       ...     ...
871          872         1       1
872          873         0       1
879          880         1       1
887          888         1       1
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                              McCarthy, Mr. Timothy J    male  54.0      0
11                            Bonnell, Miss. Elizabeth  female  58.0      0
23                        Sloper, Mr. William Thompson    male  28.0      0
..                                                 ...     ...   ...    ...
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
872                           Carlsson, Mr. Frans Olof    male  33.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch    Ticket     Fare        Cabin Embarked
1        0  PC 17599  71.2833          C85        C
3        0    113803  53.1000         C123        S
6        0     17463  51.8625          E46        S
11       0    113783  26.5500         C103        S
23       0    113788  35.5000           A6        S
..     ...       ...      ...          ...      ...
871      1     11751  52.5542          D35        S
872      0       695   5.0000  B51 B53 B55        S
879      1     11767  83.1583          C50        C
887      0    112053  30.0000          B42        S
889      0    111369  30.0000         C148        C

[216 rows x 12 columns]
Pclass 2   group:      PassengerId  Survived  Pclass  \
9             10         1       2
15            16         1       2
17            18         1       2
20            21         0       2
21            22         1       2
..           ...       ...     ...
866          867         1       2
874          875         1       2
880          881         1       2
883          884         0       2
886          887         0       2

                                             Name     Sex   Age  SibSp  Parch  \
9             Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1      0
15               Hewlett, Mrs. (Mary D Kingcome)   female  55.0      0      0
17                   Williams, Mr. Charles Eugene    male   NaN      0      0
20                           Fynney, Mr. Joseph J    male  35.0      0      0
21                          Beesley, Mr. Lawrence    male  34.0      0      0
..                                            ...     ...   ...    ...    ...
866                  Duran y More, Miss. Asuncion  female  27.0      1      0
874         Abelson, Mrs. Samuel (Hannah Wizosky)  female  28.0      1      0
880  Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0      1
883                 Banfield, Mr. Frederick James    male  28.0      0      0
886                         Montvila, Rev. Juozas    male  27.0      0      0

               Ticket     Fare Cabin Embarked
9              237736  30.0708   NaN        C
15             248706  16.0000   NaN        S
17             244373  13.0000   NaN        S
20             239865  26.0000   NaN        S
21             248698  13.0000   D56        S
..                ...      ...   ...      ...
866     SC/PARIS 2149  13.8583   NaN        C
874         P/PP 3381  24.0000   NaN        C
880            230433  26.0000   NaN        S
883  C.A./SOTON 34068  10.5000   NaN        S
886            211536  13.0000   NaN        S

[184 rows x 12 columns]
Pclass 3   group:      PassengerId  Survived  Pclass                                      Name  \
0              1         0       3                   Braund, Mr. Owen Harris
2              3         1       3                    Heikkinen, Miss. Laina
4              5         0       3                  Allen, Mr. William Henry
5              6         0       3                          Moran, Mr. James
7              8         0       3            Palsson, Master. Gosta Leonard
..           ...       ...     ...                                       ...
882          883         0       3              Dahlberg, Miss. Gerda Ulrika
884          885         0       3                    Sutehall, Mr. Henry Jr
885          886         0       3      Rice, Mrs. William (Margaret Norton)
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0      male  22.0      1      0         A/5 21171   7.2500   NaN        S
2    female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S
4      male  35.0      0      0            373450   8.0500   NaN        S
5      male   NaN      0      0            330877   8.4583   NaN        Q
7      male   2.0      3      1            349909  21.0750   NaN        S
..      ...   ...    ...    ...               ...      ...   ...      ...
882  female  22.0      0      0              7552  10.5167   NaN        S
884    male  25.0      0      0   SOTON/OQ 392076   7.0500   NaN        S
885  female  39.0      0      5            382652  29.1250   NaN        Q
888  female   NaN      1      2        W./C. 6607  23.4500   NaN        S
890    male  32.0      0      0            370376   7.7500   NaN        Q

[491 rows x 12 columns]

## 6.3 Quantile

Die Methode `quantile()` in Pandas berÃ¼cksichtigt keine NaN (Null)-Werte bei der Berechnung. Das bedeutet, dass NaN-Werte standardmÃ¤Ãig ausgeschlossen werden.

## 6.4 Aggregation und Sortierung

Aggregation und Sortierung
FÃ¼r welche der vorgestellten Aggregations-Funktionen beeinflusst die Sortierung der
Daten im DataFrame das Ergebnis?

In [ ]:
# Erstellen eines Beispiel-DataFrames
df = pd.DataFrame({
    'Gruppe': ['A', 'A', 'B', 'B', 'C', 'C'],
    'Wert': [3, 1, 6, 4, 5, 2]
})

# Anwenden verschiedener Aggregationsfunktionen
agg_vor_sortierung = {
    'Summe': df['Wert'].sum(),
    'Durchschnitt': df['Wert'].mean(),
    'Minimum': df['Wert'].min(),
    'Maximum': df['Wert'].max(),
    'Erster': df['Wert'].iloc[0],
    'Letzter': df['Wert'].iloc[-1]
}

# Sortieren des DataFrames
df_sortiert = df.sort_values(by='Wert')

# Wiederholte Anwendung der Aggregationsfunktionen nach Sortierung
agg_nach_sortierung = {
    'Summe': df_sortiert['Wert'].sum(),
    'Durchschnitt': df_sortiert['Wert'].mean(),
    'Minimum': df_sortiert['Wert'].min(),
    'Maximum': df_sortiert['Wert'].max(),
    'Erster': df_sortiert['Wert'].iloc[0],
    'Letzter': df_sortiert['Wert'].iloc[-1]
}

agg_vor_sortierung, agg_nach_sortierung

({'Summe': 21,
  'Durchschnitt': 3.5,
  'Minimum': 1,
  'Maximum': 6,
  'Erster': 3,
  'Letzter': 2},
 {'Summe': 21,
  'Durchschnitt': 3.5,
  'Minimum': 1,
  'Maximum': 6,
  'Erster': 1,
  'Letzter': 6})

## 6.5 Duplikate

a)

In [ ]:
t["Name"].is_unique

True

b)

In [ ]:
t_index_name = t.set_index("Name")

In [ ]:
assert t_index_name.index.is_unique, "Nicht unique"

c)

In [ ]:
t["Cabin"].is_unique

False

In [ ]:
t["Ticket"].is_unique

False

In [ ]:
ticket_cabin = t["Ticket"] + t["Cabin"]
ticket_cabin.is_unique

False

d)

In [ ]:
t_grouped_ticket_cabin = t.groupby(["Ticket", "Cabin"])[['PassengerId', 'Name']]

In [ ]:
s_t = t.groupby(by=["Ticket","Cabin"]).size()
s_t.loc[s_t>=4]

Ticket  Cabin
113760  B96 B98        4
19950   C23 C25 C27    4
dtype: int64

1. `s_t = t.groupby(by=["Ticket","Cabin"]).size()`
   - `t.groupby(by=["Ticket","Cabin"])`: Diese Funktion gruppiert den DataFrame `t` nach den Werten in den Spalten `Ticket` und `Cabin`. Das bedeutet, dass alle Zeilen mit denselben Werten in diesen beiden Spalten zu einer Gruppe zusammengefasst werden.
   - `.size()`: Nach der Gruppierung berechnet diese Methode die GrÃ¶Ãe jeder Gruppe, d.h. die Anzahl der Zeilen in `t`, die zu jeder eindeutigen Kombination von `Ticket` und `Cabin` gehÃ¶ren.
   - Das Ergebnis dieser Berechnung wird in der Variablen `s_t` gespeichert. `s_t` ist eine Serie (ein eindimensionales Datenobjekt in Pandas), wobei jeder Index die eindeutige Kombination von `Ticket` und `Cabin` reprÃ¤sentiert und der zugehÃ¶rige Wert die Anzahl der Zeilen in `t` mit dieser Kombination angibt.

2. `s_t.loc[s_t>=4]`
   - `s_t>=4`: Diese Bedingung wird auf die Serie `s_t` angewendet. Es erzeugt eine neue Serie von Wahrheitswerten (True oder False), die fÃ¼r jede Gruppe angibt, ob die Anzahl der Zeilen in dieser Gruppe gleich oder grÃ¶Ãer als 4 ist.
   - `s_t.loc[...]`: `loc` ist eine Methode zum Zugriff auf Zeilen und Spalten in Pandas-Objekten. Hier wird sie verwendet, um alle EintrÃ¤ge in `s_t` auszuwÃ¤hlen, fÃ¼r die die Bedingung `s_t>=4` wahr ist.
   - Das Ergebnis dieser Zeile ist eine Serie, die nur die Gruppen (Kombinationen von `Ticket` und `Cabin`) enthÃ¤lt, die vier oder mehr Zeilen in `t` haben. Der Wert jeder Gruppe in dieser Serie ist die Anzahl der Zeilen in `t`, die zu dieser Gruppe gehÃ¶ren.

e) Noch micht gemacht

## 6.6 SQL- Having in Pandas

In SQL wird das HAVING-SchlÃ¼sselwort verwendet, um Bedingungen nach einer Aggregation anzuwenden. In Pandas kÃ¶nnen Sie eine Ã¤hnliche FunktionalitÃ¤t erreichen, indem Sie die Methode groupby() verwenden, gefolgt von einer Aggregationsfunktion und dann die resultierenden Gruppen mit einer Bedingung filtern.

Zusammenfassend lÃ¤sst sich sagen, dass Sie in Pandas das HAVING-SchlÃ¼sselwort aus SQL durch die Kombination von groupby(), agg() und Bedingungen mit loc[] abbilden kÃ¶nnen.